#include <stdio.h>
#include <stdlib.h>
#include <math.h>

#define N 4          // 次元数 
#define EPS 1e-10    // 正則性判定用閾値 

// ガウスの消去法---------------------------------------------
void gauss(double a[][N], double b[], double x[])
{
    double m, s;
    int i, j, k;

    // 前進消去----------------------------------------
    for (i = 0; i < N - 1; i++) {

        for (j = i + 1; j < N; j++) {

            m = a[j][i] / a[i][i];

            for (k = i + 1; k < N; k++) {
                a[j][k] = a[j][k] - m * a[i][k];
            }
            b[j] = b[j] - m * b[i];
        }
    }

    // 後退代入----------------------------------------
    x[N - 1] = b[N - 1] / a[N - 1][N - 1];
    for (i = N - 2; i >= 0; i--) {

        s = 0;
        for (j = i + 1; j < N; j++) {
            s += a[i][j] * x[j];
        }

        x[i] = (b[i] - s) / a[i][i];
    }
}

// 部分ピボット選択付きガウスの消去法----------------------------------------------
void pivoted_gauss(double a[][N], double b[], double x[])
{
    int i, j, k, max_i;
    double m, s, max, tmp;

    // 前進消去------------------------------------------------------------
    for (i = 0; i < N - 1; i++)
    {
        // 部分ピボット選択-----------------------------------------
        max = fabs(a[i][i]);
        max_i = i;
        for (j = i + 1; j < N; j++) {

            if (fabs(a[j][i]) > max) {
                max = fabs(a[j][i]);
                max_i = j;
            }
        }

        if (max < EPS) {

            printf("係数行列が正則ではありません");
            exit(1);
        }
        else if (max_i != i) {

            for (j = i; j < N; j++) {
                tmp = a[i][j]; a[i][j] = a[max_i][j]; a[max_i][j] = tmp;
            }
            tmp = b[i]; b[i] = b[max_i]; b[max_i] = tmp;
        }

        // 前進消去-------------------------------------------------
        for (j = i + 1; j < N; j++) {

            m = a[j][i] / a[i][i];

            for (k = i + 1; k < N; k++) {
                a[j][k] = a[j][k] - m * a[i][k];
            }
            b[j] = b[j] - m * b[i];
        }
    }

    // 後退代入------------------------------------------------------------
    x[N - 1] = b[N - 1] / a[N - 1][N - 1];
    for (i = N - 2; i >= 0; i--) {

        s = 0;
        for (j = i + 1; j < N; j++) {
            s += a[i][j] * x[j];
        }
        x[i] = (b[i] - s) / a[i][i];
    }
}

// メイン関数----------------------------------------------------------------------
int main(void) {

    double a1[N][N] = {
        {  1.13,  40.5,  1.52,  20.1 },
        { -2.02, -72.4, -3.10, -36.3 },
        { -1.36, -48.7,  7.55, -20.7 },
        {  80.5,  2.32,  1.23, -38.9 }
    };
    double b1[N] = {
        -2.21,
         3.98,
        -9.16,
        -2.08
    };

    double a2[N][N] = {
        {  1.13,  40.5,  1.52,  20.1 },
        { -2.02, -72.4, -3.10, -36.3 },
        { -1.36, -48.7,  7.55, -20.7 },
        {  80.5,  2.32,  1.23, -38.9 }
    };
    double b2[N] = {
        -2.21,
         3.98,
        -9.16,
        -2.08
    };

    double x[N];
    int i;

    gauss(a1, b1, x);

    printf("ガウスの消去法：\n");
    for (i = 0; i < N; i++) {
        printf("x[%d] = %19.15lf\n", i, x[i]);
    }

    pivoted_gauss(a2, b2, x);

    printf("\nピボット選択付きガウスの消去法：\n");
    for (i = 0; i < N; i++) {
        printf("x[%d] = %19.15lf\n", i, x[i]);
    }

    return 0;
}






