#include <stdio.h>

/* 行列の和計算 */
void matrix_sum(double C[][4], double A[][4], double B[][4]) {

	int i, j;

	// 行のスープ---------------------------------------------
	for (i = 0; i < 4; i++) {

		// 列のループ-----------------------------------------
		for (j = 0; j < 4; j++) {
			C[i][j] = A[i][j] + B[i][j];
		}
	}
}

/* メイン関数 */
int main() {

	double A[4][4] = {
		{ 1.0,  2.0,  3.0,  4.0},
		{ 0.0,  1.0,  2.0, -1.0},
		{-1.0, -3.0,  4.0,  1.0},
		{ 2.0,  0.0,  3.0,  5.0}
	};

	double B[4][4] = {
		{ 4.0, -1.0,  2.0, -2.0},
		{ 1.0,  0.0,  2.0, -3.0},
		{ 2.0,  2.0,  0.0, -1.0},
		{-2.0,  4.0,  1.0, -1.0}
	};

	double C[4][4];
	int i, j;

	matrix_sum(C, A, B);

	printf("C=A+Bの計算結果\n");
	for (i = 0; i < 4; i++) {
		for (j = 0; j < 4; j++) {
			printf("%5.2f,\t", C[i][j]);
		}
		printf("\n");
	}

	return 0;
}